``` Terraform will perform the following actions:

  # aws_route53_record.usegalaxy_eu_forwardmail_validation_txt will be updated in-place
  ~ resource "aws_route53_record" "usegalaxy_eu_forwardmail_validation_txt" {
        id              = "Z1C7L7XFF9613J__TXT"
      ~ ttl             = 10 -> 3600
        # (5 unchanged attributes hidden)
    }

  # openstack_blockstorage_volume_v3.engy-vol will be created
  + resource "openstack_blockstorage_volume_v3" "engy-vol" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for engy VM"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = (known after apply)
      + region            = (known after apply)
      + size              = 500
      + volume_type       = "default"
    }

  # openstack_compute_instance_v2.engy will be created
  + resource "openstack_compute_instance_v2" "engy" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "c1.c36m100d50"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "f2309846-2c2c-4b0f-aa95-8af7cd67d067"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "engy-dedicated-VM"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "1bc6608786c03e54bd3e6c35920958a111d5c2f6"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.engy-va will be created
  + resource "openstack_compute_volume_attach_v2" "engy-va" {
      + device      = "/dev/vdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # random_id.engy-volume-name-unique will be created
  + resource "random_id" "engy-volume-name-unique" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```